Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports
The Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports handles the imports of TS state data.

Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.GetCommandName


Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.GetCurrentCommand


Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.GetEndCommandName(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData@)


Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.SetCommandConsumed


Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.Interrupt(System.Int32,System.Int32)


Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.IsDmActive


Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.DotExportGetCommandName(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData@)
Gets the data describing a started command.
pArgument: The value to write the command name to.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.DotExportGetCurrentCommandName(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData@)
Gets the name of the current command.
pArgument: The value to write the command name to.
Returns: The name of the current command.

Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.DotExportInterrupt(System.Int32,System.Int32)
Interrupts the active command.
notifyDm: A value indicating whether to notify DM.
forceResetDotNetCallbacks: A value indicating whether to reset the .NET callbacks.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.DotExportGetEndCommandName(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData@)
Gets the data describing an ended command.
pArgument: The value to write the command name to.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.DotExportSetCommandConsumed
Notifies when a started command is consumed by a DM feature, and that the platform will handle the life-time.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.StateImports.DotExportIsDmActive
Determines whether DM is active.
Returns: True if DM is active; otherwise, false.